tiborsimon/embedded-tdd-headers/pic/pic16/pic16f1579_tdd.h
#define IOCCF3                        522
#define IOCCF4                        523
#define IOCCF5                        524
#define IOCCF6                        525
#define IOCCF7                        526
#define CWG1DBR0                      527
#define CWG1DBR                       528
#define CWG1DBR1                      529
#define CWG1DBR2                      530
#define CWG1DBR3                      531
#define CWG1DBR4                      532
#define CWG1DBR5                      533
#define CWG1DBF                       534
#define CWG1DBF0                      535
#define CWG1DBF1                      536
#define CWG1DBF2                      537
#define CWG1DBF3                      538
#define CWG1DBF4                      539
#define CWG1DBF5                      540
#define CWG1CON0                      541
#define G1CS0                         542
#define G1CS                          543
#define G1POLA                        544
#define G1POLB                        545
#define G1OEA                         546
#define G1OEB                         547
#define G1EN                          548
#define CWG1CON1                      549
#define G1IS0                         550
#define G1IS                          551
#define G1IS1                         552
#define G1IS2                         553
#define G1ASDLA                       554
#define G1ASDLA0                      555
#define G1ASDLA1                      556
#define G1ASDLB                       557
#define G1ASDLB0                      558
#define G1ASDLB1                      559
#define CWG1CON2                      560
#define G1ASDSPPS                     561
#define G1ASDSC1                      562
#define G1ASDSC2                      563
#define G1ARSEN                       564
#define G1ASE                         565
#define PWMEN                         566
#define MPWM1EN                       567
#define PWM1EN_A                      568
#define MPWM2EN                       569
#define PWM2EN_A                      570
#define MPWM3EN                       571
#define PWM3EN_A                      572
#define PWM4EN_A                      573
#define PWMLD                         574
#define MPWM1LD                       575
#define PWM1LDA_A                     576
#define MPWM2LD                       577
#define PWM2LDA_A                     578
#define PWM3LDA_A                     579
#define MPWM3LD                       580
#define PWM4LDA_A                     581
#define PWMOUT                        582
#define PWM1OUT_A                     583
#define MPWM1OUT                      584
#define MPWM2OUT                      585
#define PWM2OUT_A                     586
#define MPWM3OUT                      587
#define PWM3OUT_A                     588
#define PWM4OUT_A                     589
#define PWM1PHL                       590
#define PWM1PHL0                      591
#define PWM1PHL_PH                    592
#define PWM1PHL1                      593
#define PWM1PHL2                      594
#define PWM1PHL3                      595
#define PWM1PHL4                      596
#define PWM1PHL5                      597
#define PWM1PHL6                      598
#define PWM1PHL7                      599
#define PWM1PHH                       600
#define PWM1PHH0                      601
#define PWM1PHH_PH                    602
#define PWM1PHH1                      603
#define PWM1PHH2                      604
#define PWM1PHH3                      605
#define PWM1PHH4                      606
#define PWM1PHH5                      607
#define PWM1PHH6                      608
#define PWM1PHH7                      609
#define PWM1DCL_DC                    610
#define PWM1DCL                       611
#define PWM1DCL0                      612
#define PWM1DCL1                      613
#define PWM1DCL2                      614
#define PWM1DCL3                      615
#define PWM1DCL4                      616
#define PWM1DCL5                      617
#define PWM1DCL6                      618
#define PWM1DCL7                      619
#define PWM1DCH_DC                    620
#define PWM1DCH                       621
#define PWM1DCH0                      622
#define PWM1DCH1                      623
#define PWM1DCH2                      624
#define PWM1DCH3                      625
#define PWM1DCH4                      626
#define PWM1DCH5                      627
#define PWM1DCH6                      628
#define PWM1DCH7                      629
#define PWM1PRL                       630
#define PWM1PRL0                      631
#define PWM1PRL_PR                    632
#define PWM1PRL1                      633
#define PWM1PRL2                      634
#define PWM1PRL3                      635
#define PWM1PRL4                      636
#define PWM1PRL5                      637
#define PWM1PRL6                      638
#define PWM1PRL7                      639
#define PWM1PRH                       640
#define PWM1PRH_PR                    641
#define PWM1PRH0                      642
#define PWM1PRH1                      643
#define PWM1PRH2                      644
#define PWM1PRH3                      645
#define PWM1PRH4                      646
#define PWM1PRH5                      647
#define PWM1PRH6                      648
#define PWM1PRH7                      649
#define PWM1OFL0                      650
#define PWM1OFL_OF                    651
#define PWM1OFL                       652
#define PWM1OFL1                      653
#define PWM1OFL2                      654
#define PWM1OFL3                      655
#define PWM1OFL4                      656
#define PWM1OFL5                      657
#define PWM1OFL6                      658
#define PWM1OFL7                      659
#define PWM1OFH_OF                    660
#define PWM1OFH                       661
#define PWM1OFH0                      662
#define PWM1OFH1                      663
#define PWM1OFH2                      664
#define PWM1OFH3                      665
#define PWM1OFH4                      666
#define PWM1OFH5                      667
#define PWM1OFH6                      668
#define PWM1OFH7                      669
#define PWM1TMRL0                     670
#define PWM1TMRL_TMR                  671
#define PWM1TMRL                      672
#define PWM1TMRL1                     673
#define PWM1TMRL2                     674
#define PWM1TMRL3                     675
#define PWM1TMRL4                     676
#define PWM1TMRL5                     677
#define PWM1TMRL6                     678
#define PWM1TMRL7                     679
#define PWM1TMRH                      680
#define PWM1TMRH0                     681
#define PWM1TMRH_TMR                  682
#define PWM1TMRH1                     683
#define PWM1TMRH2                     684
#define PWM1TMRH3                     685
#define PWM1TMRH4                     686
#define PWM1TMRH5                     687
#define PWM1TMRH6                     688
#define PWM1TMRH7                     689
#define PWM1CON                       690
#define PWM1CON_MODE                  691
#define PWM1MODE0                     692
#define PWM1MODE                      693
#define PWM1CON_MODE0                 694
#define PWM1MODE1                     695
#define PWM1CON_MODE1                 696
#define PWM1CON_POL                   697
#define PWM1POL                       698
#define PWM1CON_OUT                   699
#define PWM1OUT                       700
#define PWM1OE                        701
#define PWM1CON_OE                    702
#define PWM1EN                        703
#define PWM1CON_EN                    704
#define PWM1INTE                      705
#define PWM1PRIE                      706
#define PWM1INTE_PRIE                 707
#define PWM1DCIE                      708
#define PWM1INTE_DCIE                 709
#define PWM1INTE_PHIE                 710
#define PWM1PHIE                      711
#define PWM1OFIE                      712
#define PWM1INTE_OFIE                 713
#define PWM1INTF                      714
#define PWM1INTF_PRIF                 715
#define PWM1PRIF                      716
#define PWM1INTF_DCIF                 717
#define PWM1DCIF                      718
#define PWM1PHIF                      719
#define PWM1INTF_PHIF                 720
#define PWM1OFIF                      721
#define PWM1INTF_OFIF                 722
#define PWM1CLKCON                    723
#define PWM1CLKCON_CS                 724
#define PWM1CS                        725
#define PWM1CLKCON_CS0                726
#define PWM1CS0                       727
#define PWM1CLKCON_CS1                728
#define PWM1CS1                       729
#define PWM1CLKCON_PS0                730
#define PWM1PS                        731
#define PWM1PS0                       732
#define PWM1CLKCON_PS                 733
#define PWM1PS1                       734
#define PWM1CLKCON_PS1                735
#define PWM1PS2                       736
#define PWM1CLKCON_PS2                737
#define PWM1LDCON                     738
#define PWM1LDCON_LDS0                739
#define PWM1LDS                       740
#define PWM1LDCON_LDS                 741
#define PWM1LDS0                      742
#define PWM1LDCON_LDS1                743
#define PWM1LDS1                      744
#define PWM1LDCON_LDT                 745
#define PWM1LDM                       746
#define PWM1LD                        747
#define PWM1LDCON_LDA                 748
#define PWM1OFCON                     749
#define PWM1OFCON_OFS0                750
#define PWM1OFS                       751
#define PWM1OFCON_OFS                 752
#define PWM1OFS0                      753
#define PWM1OFCON_OFS1                754
#define PWM1OFS1                      755
#define PWM1OFMC                      756
#define PWM1OFCON_OFO                 757
#define PWM1OFM0                      758
#define PWM1OFM                       759
#define PWM1OFCON_OFM0                760
#define PWM1OFCON_OFM                 761
#define PWM1OFM1                      762
#define PWM1OFCON_OFM1                763
#define PWM2PHL_PH                    764
#define PWM2PHL0                      765
#define PWM2PHL                       766
#define PWM2PHL1                      767
#define PWM2PHL2                      768
#define PWM2PHL3                      769
#define PWM2PHL4                      770
#define PWM2PHL5                      771
#define PWM2PHL6                      772
#define PWM2PHL7                      773
#define PWM2PHH0                      774
#define PWM2PHH                       775
#define PWM2PHH_PH                    776
#define PWM2PHH1                      777
#define PWM2PHH2                      778
#define PWM2PHH3                      779
#define PWM2PHH4                      780
#define PWM2PHH5                      781
#define PWM2PHH6                      782
#define PWM2PHH7                      783
#define PWM2DCL_DC                    784
#define PWM2DCL0                      785
#define PWM2DCL                       786
#define PWM2DCL1                      787
#define PWM2DCL2                      788
#define PWM2DCL3                      789
#define PWM2DCL4                      790
#define PWM2DCL5                      791
#define PWM2DCL6                      792
#define PWM2DCL7                      793
#define PWM2DCH0                      794
#define PWM2DCH_DC                    795
#define PWM2DCH                       796
#define PWM2DCH1                      797
#define PWM2DCH2                      798
#define PWM2DCH3                      799
#define PWM2DCH4                      800
#define PWM2DCH5                      801
#define PWM2DCH6                      802
#define PWM2DCH7                      803
#define PWM2PRL0                      804
#define PWM2PRL_PR                    805
#define PWM2PRL                       806
#define PWM2PRL1                      807
#define PWM2PRL2                      808
#define PWM2PRL3                      809
#define PWM2PRL4                      810
#define PWM2PRL5                      811
#define PWM2PRL6                      812
#define PWM2PRL7                      813
#define PWM2PRH0                      814
#define PWM2PRH                       815
#define PWM2PRH_PR                    816
#define PWM2PRH1                      817
#define PWM2PRH2                      818
#define PWM2PRH3                      819
#define PWM2PRH4                      820
#define PWM2PRH5                      821
#define PWM2PRH6                      822
#define PWM2PRH7                      823
#define PWM2OFL                       824
#define PWM2OFL_OF                    825
#define PWM2OFL0                      826
#define PWM2OFL1                      827
#define PWM2OFL2                      828
#define PWM2OFL3                      829
#define PWM2OFL4                      830
#define PWM2OFL5                      831
#define PWM2OFL6                      832
#define PWM2OFL7                      833
#define PWM2OFH                       834
#define PWM2OFH0                      835
#define PWM2OFH_OF                    836
#define PWM2OFH1                      837
#define PWM2OFH2                      838
#define PWM2OFH3                      839
#define PWM2OFH4                      840
#define PWM2OFH5                      841
#define PWM2OFH6                      842
#define PWM2OFH7                      843
#define PWM2TMRL_TMR                  844
#define PWM2TMRL0                     845
#define PWM2TMRL                      846
#define PWM2TMRL1                     847
#define PWM2TMRL2                     848
#define PWM2TMRL3                     849
#define PWM2TMRL4                     850
#define PWM2TMRL5                     851
#define PWM2TMRL6                     852
#define PWM2TMRL7                     853
#define PWM2TMRH_TMR                  854
#define PWM2TMRH                      855
#define PWM2TMRH0                     856
#define PWM2TMRH1                     857
#define PWM2TMRH2                     858
#define PWM2TMRH3                     859
#define PWM2TMRH4                     860
#define PWM2TMRH5                     861
#define PWM2TMRH6                     862
#define PWM2TMRH7                     863
#define PWM2CON                       864
#define PWM2MODE0                     865
#define PWM2MODE                      866
#define PWM2CON_MODE0                 867
#define PWM2CON_MODE                  868
#define PWM2MODE1                     869
#define PWM2CON_MODE1                 870
#define PWM2POL                       871
#define PWM2CON_POL                   872
#define PWM2CON_OUT                   873
#define PWM2OUT                       874
#define PWM2OE                        875
#define PWM2CON_OE                    876
#define PWM2EN                        877
#define PWM2CON_EN                    878
#define PWM2INTE                      879
#define PWM2INTE_PRIE                 880
#define PWM2PRIE                      881
#define PWM2INTE_DCIE                 882
#define PWM2DCIE                      883
#define PWM2INTE_PHIE                 884
#define PWM2PHIE                      885
#define PWM2INTE_OFIE                 886
#define PWM2OFIE                      887
#define PWM2INTF                      888
#define PWM2INTF_PRIF                 889
#define PWM2PRIF                      890
#define PWM2INTF_DCIF                 891
#define PWM2DCIF                      892
#define PWM2INTF_PHIF                 893
#define PWM2PHIF                      894
#define PWM2INTF_OFIF                 895
#define PWM2OFIF                      896
#define PWM2CLKCON                    897
#define PWM2CS0                       898
#define PWM2CS                        899
#define PWM2CLKCON_CS0                900
#define PWM2CLKCON_CS                 901
#define PWM2CLKCON_CS1                902
#define PWM2CS1                       903
#define PWM2CLKCON_PS                 904
#define PWM2CLKCON_PS0                905
#define PWM2PS0                       906
#define PWM2PS                        907
#define PWM2PS1                       908
#define PWM2CLKCON_PS1                909
#define PWM2PS2                       910
#define PWM2CLKCON_PS2                911
#define PWM2LDCON                     912
#define PWM2LDCON_LDS0                913
#define PWM2LDS0                      914
#define PWM2LDCON_LDS                 915
#define PWM2LDS                       916
#define PWM2LDS1                      917
#define PWM2LDCON_LDS1                918
#define PWM2LDM                       919
#define PWM2LDCON_LDT                 920
#define PWM2LD                        921
#define PWM2LDCON_LDA                 922
#define PWM2OFCON                     923
#define PWM2OFS                       924
#define PWM2OFS0                      925
#define PWM2OFCON_OFS0                926
#define PWM2OFCON_OFS                 927
#define PWM2OFCON_OFS1                928
#define PWM2OFS1                      929
#define PWM2OFMC                      930
#define PWM2OFCON_OFO                 931
#define PWM2OFCON_OFM0                932
#define PWM2OFM                       933
#define PWM2OFCON_OFM                 934
#define PWM2OFM0                      935
#define PWM2OFCON_OFM1                936
#define PWM2OFM1                      937
#define PWM3PHL                       938
#define PWM3PHL_PH                    939
#define PWM3PHL0                      940
#define PWM3PHL1                      941
#define PWM3PHL2                      942
#define PWM3PHL3                      943
#define PWM3PHL4                      944
#define PWM3PHL5                      945
#define PWM3PHL6                      946
#define PWM3PHL7                      947
#define PWM3PHH0                      948
#define PWM3PHH                       949
#define PWM3PHH_PH                    950
#define PWM3PHH1                      951
#define PWM3PHH2                      952
#define PWM3PHH3                      953
#define PWM3PHH4                      954
#define PWM3PHH5                      955
#define PWM3PHH6                      956
#define PWM3PHH7                      957
#define PWM3DCL_DC                    958
#define PWM3DCL0                      959
#define PWM3DCL                       960
#define PWM3DCL1                      961
#define PWM3DCL2                      962
#define PWM3DCL3                      963
#define PWM3DCL4                      964
#define PWM3DCL5                      965
#define PWM3DCL6                      966
#define PWM3DCL7                      967
#define PWM3DCH_DC                    968
#define PWM3DCH0                      969
#define PWM3DCH                       970
#define PWM3DCH1                      971
#define PWM3DCH2                      972
#define PWM3DCH3                      973
#define PWM3DCH4                      974
#define PWM3DCH5                      975
#define PWM3DCH6                      976
#define PWM3DCH7                      977
#define PWM3PRL0                      978
#define PWM3PRL                       979
#define PWM3PRL_PR                    980
#define PWM3PRL1                      981
#define PWM3PRL2                      982
#define PWM3PRL3                      983
#define PWM3PRL4                      984
#define PWM3PRL5                      985
#define PWM3PRL6                      986
#define PWM3PRL7                      987
#define PWM3PRH0                      988
#define PWM3PRH_PR                    989
#define PWM3PRH                       990
#define PWM3PRH1                      991
#define PWM3PRH2                      992
#define PWM3PRH3                      993
#define PWM3PRH4                      994
#define PWM3PRH5                      995
#define PWM3PRH6                      996
#define PWM3PRH7                      997
#define PWM3OFL_OF                    998
#define PWM3OFL0                      999
#define PWM3OFL                       1000
#define PWM3OFL1                      1001
#define PWM3OFL2                      1002
#define PWM3OFL3                      1003
#define PWM3OFL4                      1004
#define PWM3OFL5                      1005
#define PWM3OFL6                      1006
#define PWM3OFL7                      1007
#define PWM3OFH_OF                    1008
#define PWM3OFH0                      1009
#define PWM3OFH                       1010
#define PWM3OFH1                      1011
#define PWM3OFH2                      1012
#define PWM3OFH3                      1013
#define PWM3OFH4                      1014
#define PWM3OFH5                      1015
#define PWM3OFH6                      1016
#define PWM3OFH7                      1017
#define PWM3TMRL0                     1018
#define PWM3TMRL                      1019
#define PWM3TMRL_TMR                  1020
#define PWM3TMRL1                     1021
#define PWM3TMRL2                     1022
#define PWM3TMRL3                     1023
#define PWM3TMRL4                     1024
#define PWM3TMRL5                     1025
#define PWM3TMRL6                     1026
#define PWM3TMRL7                     1027
#define PWM3TMRH0                     1028
#define PWM3TMRH_TMR                  1029
#define PWM3TMRH                      1030
#define PWM3TMRH1                     1031
#define PWM3TMRH2                     1032
#define PWM3TMRH3                     1033
#define PWM3TMRH4                     1034
#define PWM3TMRH5                     1035
#define PWM3TMRH6                     1036
#define PWM3TMRH7                     1037
#define PWM3CON                       1038
#define PWM3CON_MODE0                 1039
#define PWM3MODE                      1040
#define PWM3CON_MODE                  1041
#define PWM3MODE0                     1042
#define PWM3CON_MODE1                 1043
#define PWM3MODE1                     1044
#define PWM3CON_POL                   1045
#define PWM3POL                       1046
#define PWM3CON_OUT                   1047
#define PWM3OUT                       1048
#define PWM3OE                        1049
#define PWM3CON_OE                    1050
#define PWM3EN                        1051
#define PWM3CON_EN                    1052
#define PWM3INTE                      1053
#define PWM3PRIE                      1054
#define PWM3INTE_PRIE                 1055
#define PWM3INTE_DCIE                 1056
#define PWM3DCIE                      1057
#define PWM3PHIE                      1058
#define PWM3INTE_PHIE                 1059
#define PWM3INTE_OFIE                 1060
#define PWM3OFIE                      1061
#define PWM3INTF                      1062
#define PWM3PRIF                      1063
#define PWM3INTF_PRIF                 1064
#define PWM3INTF_DCIF                 1065
#define PWM3DCIF                      1066
#define PWM3INTF_PHIF                 1067
#define PWM3PHIF                      1068
#define PWM3INTF_OFIF                 1069
#define PWM3OFIF                      1070
#define PWM3CLKCON                    1071
#define PWM3CLKCON_CS                 1072
#define PWM3CS                        1073
#define PWM3CS0                       1074
#define PWM3CLKCON_CS0                1075
#define PWM3CS1                       1076
#define PWM3CLKCON_CS1                1077
#define PWM3PS0                       1078
#define PWM3CLKCON_PS                 1079
#define PWM3CLKCON_PS0                1080
#define PWM3PS                        1081
#define PWM3PS1                       1082
#define PWM3CLKCON_PS1                1083
#define PWM3PS2                       1084
#define PWM3CLKCON_PS2                1085
#define PWM3LDCON                     1086
#define PWM3LDCON_LDS                 1087
#define PWM3LDS0                      1088
#define PWM3LDS                       1089
#define PWM3LDCON_LDS0                1090
